УТ_для_edt/src/Catalogs/ПапкиЭлектронныхПисем/ПапкиЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиЭлектронныхПисем</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.УчетныеЗаписиЭлектроннойПочты</owners>
  <attributes>
    <name>ПредопределеннаяПапка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Вид</name>
    <type>
      <types>EnumRef.CRM_ВидыПапокЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПапкаMSExchange</name>
    <type>
      <types>CatalogRef.CRM_СтруктурыПапокMSExchange</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>CRM</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Подписаться</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредопределеннойПапки</name>
    <type>
      <types>EnumRef.ТипыПредопределенныхПапокПисем</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_ОтложенныеОперацииПоIMAP/CRM_ОтложенныеОперацииПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОтложенныеОперацииПоIMAP</name>
  <attributes>
    <name>ИмяПапкиНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>EnumRef.CRM_ДействияПоIMAP</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ДействияПоIMAP/CRM_ДействияПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ДействияПоIMAP</name>
  <enumValues>
    <name>ПереместитьВсеПисьмаВПапку</name>
  </enumValues>
  <enumValues>
    <name>ПереместитьПисьмоВПапку</name>
  </enumValues>
  <enumValues>
    <name>СнятьФлагПрочтения</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьФлагПрочтения</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ПапкиЭлектронныхПисем/Forms/CRM_ФормаСинхронизацииПапок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Отказ = Истина;
	КонецЕсли;	
	
	ТолькоПросмотр = НЕ CRM_УправлениеЭлектроннойПочтой.ТекущийПользовательПолучитьПравоУчетнойЗаписи(УчетнаяЗапись, "Администрирование");
	Элементы.ПапкиУчетнойЗаписиПодписать.ТолькоПросмотр = ТолькоПросмотр;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Настройка синхронизации для %1';en='Synchronization setting for %1'"), УчетнаяЗапись);
	ЗаполнитьПапкиУчетнойЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПапкиУчетнойЗаписи()
	
	Исключаемые = Новый Массив;
	Исключаемые.Добавить(Перечисления.CRM_ВидыПапокЭлектроннойПочты.Исходящие);
	//Исключаемые.Добавить(Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПапкиЭлектронныхПисем.Ссылка КАК Ссылка,
	                      |	ПапкиЭлектронныхПисем.Наименование КАК Имя,
	                      |	ПапкиЭлектронныхПисем.CRM_Подписаться КАК Подписаться,
	                      |	ПапкиЭлектронныхПисем.CRM_Вид КАК Вид,
	                      |	ВЫБОР
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Входящие)
	                      |			ТОГДА 0
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Исходящие)
	                      |			ТОГДА 1
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Отправленные)
	                      |			ТОГДА 2
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Черновики)
	                      |			ТОГДА 3
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Удаленные)
	                      |			ТОГДА 4
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.Обработанные)
	                      |			ТОГДА 6
	                      |		КОГДА ПапкиЭлектронныхПисем.CRM_Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта)
	                      |			ТОГДА 7
	                      |		ИНАЧЕ 8
	                      |	КОНЕЦ КАК Картинка,
	                      |	ПапкиЭлектронныхПисем.Родитель КАК Родитель
	                      |ИЗ
	                      |	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
	                      |ГДЕ
	                      |	ПапкиЭлектронныхПисем.Владелец = &Владелец
	                      |	И НЕ ПапкиЭлектронныхПисем.ПометкаУдаления
	                      |	И НЕ ПапкиЭлектронныхПисем.CRM_Вид В (&Исключаемые)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПапкиЭлектронныхПисем.РеквизитДопУпорядочивания
	                      |ИТОГИ ПО
	                      |	Ссылка ИЕРАРХИЯ");
	
	Запрос.УстановитьПараметр("Владелец", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Исключаемые", Исключаемые);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДеревоПапок = РеквизитФормыВЗначение("ПапкиУчетнойЗаписи");
	ДеревоПапок.Строки.Очистить();
	
	ВыборкаСИерархией=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка");
	ВыбратьЭлементыВИерархии(ВыборкаСИерархией,ДеревоПапок);

	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Истина);
	
	Протокол = ПротоколИнтернетПочты.IMAP;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, Протокол);
	Исключение
		
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Во время подключения к учетной записи %1 произошла ошибка"
"%2';en='An error occurred when connecting to account %1"
"%2'"),
				УчетнаяЗапись,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);	
		
		Возврат;
		
	КонецПопытки;
	
	МассивПапок = Почта.ПолучитьПочтовыеЯщики();
	Разделитель = "/";
	Попытка
		Разделитель = Почта.СимволРазделитель;
	Исключение
	КонецПопытки;
	Для Каждого ИмяПапки из МассивПапок Цикл
		Если ВРег(ИмяПапки) = ВРег("Inbox") ИЛИ ВРег(ИмяПапки) = ВРег("Входящие") Тогда
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Вид", Перечисления.CRM_ВидыПапокЭлектроннойПочты.Входящие), Истина);
			Если Строки.Количество()>0 Тогда
				Если Строки[0].ИмяНаСервере<>ИмяПапки Тогда
					Строки[0].ИмяНаСервере = ИмяПапки;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ИмяПапки из МассивПапок Цикл
		Если ВРег(ИмяПапки) = ВРег("Sent") ИЛИ ВРег(ИмяПапки) = ВРег("Отправленные") Тогда
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Вид", Перечисления.CRM_ВидыПапокЭлектроннойПочты.Отправленные), Истина);
			Если Строки.Количество()>0 Тогда
				Если Строки[0].ИмяНаСервере<>ИмяПапки Тогда
					Строки[0].ИмяНаСервере = ИмяПапки;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВРег(ИмяПапки) = ВРег("draftBox") ИЛИ ВРег(ИмяПапки) = ВРег("Drafts") ИЛИ ВРег(ИмяПапки) = ВРег("Черновики") Тогда
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Вид", Перечисления.CRM_ВидыПапокЭлектроннойПочты.Черновики), Истина);
			Если Строки.Количество()>0 Тогда
				Если Строки[0].ИмяНаСервере<>ИмяПапки Тогда
					Строки[0].ИмяНаСервере = ИмяПапки;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВРег(ИмяПапки) = ВРег("Trash") ИЛИ ВРег(ИмяПапки) = ВРег("Корзина")
			ИЛИ ВРег(ИмяПапки) = ВРег("deleted") ИЛИ ВРег(ИмяПапки) = ВРег("удаленные") Тогда
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Вид", Перечисления.CRM_ВидыПапокЭлектроннойПочты.Удаленные), Истина);
			Если Строки.Количество()>0 Тогда
				Если Строки[0].ИмяНаСервере<>ИмяПапки Тогда
					Строки[0].ИмяНаСервере = ИмяПапки;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВРег(ИмяПапки) = ВРег("Spam") ИЛИ ВРег(ИмяПапки) = ВРег("Спам") Тогда
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Вид", Перечисления.CRM_ВидыПапокЭлектроннойПочты.НежелательнаяПочта), Истина);
			Если Строки.Количество()>0 Тогда
				Если Строки[0].ИмяНаСервере<>ИмяПапки Тогда
					Строки[0].ИмяНаСервере = ИмяПапки;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("ИмяНаСервере", ИмяПапки), Истина);
			Если Строки.Количество() = 0 Тогда
				СтруктураПапки = ПолучитьСтруктуруПапки(ИмяПапки, Разделитель);
				Если ЗначениеЗаполнено(СтруктураПапки.Родитель) Тогда
					Родитель = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("ИмяНаСервере", СтруктураПапки.Родитель), Истина);
					Если Родитель.Количество() > 0 Тогда
						Родитель = Родитель[0];
						РодительСтроки = Родитель.Строки.НайтиСтроки(Новый Структура("Имя", СтруктураПапки.Имя), Истина);
						Если РодительСтроки.Количество()>0 Тогда
							РодительСтроки[0].ИмяНаСервере = ИмяПапки;
							Продолжить;
						КонецЕсли;
					Иначе
						Родитель = ДеревоПапок.Строки.Добавить();
						Родитель.Имя = СтруктураПапки.Родитель;
						Родитель.Картинка = 8;
						Родитель.ИмяНаСервере = СтруктураПапки.Родитель;
					КонецЕсли;
					Папка = Родитель.Строки.Добавить();
					Папка.Имя = СтруктураПапки.Имя;
					Папка.Картинка = 8;
					Папка.ИмяНаСервере = ИмяПапки;
				Иначе
					Строки = ДеревоПапок.Строки.НайтиСтроки(Новый Структура("Имя", СтруктураПапки.Имя), Истина);
					Если Строки.Количество()>0 Тогда
						Строки[0].ИмяНаСервере = ИмяПапки;
						Продолжить;
					КонецЕсли;
					Папка = ДеревоПапок.Строки.Добавить();
					Папка.Имя = ИмяПапки;
					Папка.Картинка = 8;
					Папка.ИмяНаСервере = ИмяПапки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПапок, "ПапкиУчетнойЗаписи");
	
КонецПроцедуры

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией,Дерево)
	Пока ВыборкаСИерархией.Следующий() Цикл
		Если ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") И Дерево.Ссылка = ВыборкаСИерархией.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Папка=Дерево.Строки.Добавить();
		Папка.Имя = ВыборкаСИерархией.Имя;
		Папка.Ссылка = ВыборкаСИерархией.Ссылка;
		Папка.Подписаться = ВыборкаСИерархией.Подписаться;
		Папка.Вид = ВыборкаСИерархией.Вид;
		Папка.Картинка = ВыборкаСИерархией.Картинка;
		Если ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			ВыбратьЭлементыВИерархии(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"), Папка);
		КонецЕсли;   
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСтруктуруПапки(ИмяПапки, Разделитель)
	
	СтруктураПапки = Новый Структура;
	ПозицияРазделителя = СтрНайти(ИмяПапки, Разделитель, НаправлениеПоиска.СКонца);
	Если ПозицияРазделителя = 0 Тогда
		СтруктураПапки.Вставить("Имя", ИмяПапки);
		СтруктураПапки.Вставить("Родитель", Неопределено);
	Иначе
		СтруктураПапки.Вставить("Имя", Сред(ИмяПапки, ПозицияРазделителя+1));
		СтруктураПапки.Вставить("Родитель", Лев(ИмяПапки, ПозицияРазделителя-1));
	КонецЕсли;
	
	Возврат СтруктураПапки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПодпискуВДереве(Ветка, Подписка)
	
	Ветки = Ветка.ПолучитьЭлементы();
	Для каждого ТекВетка из Ветки Цикл
		ТекВетка.Подписаться = Подписка;
		УстановитьПодпискуВДереве(ТекВетка, Подписка)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПрименитьНаСервере(ЕстьОшибки)
	
	ДеревоПапок = РеквизитФормыВЗначение("ПапкиУчетнойЗаписи");
	
	СоздаваемыеНаСервереПапки = Новый Соответствие;
	ОбработатьПапкиРекурсивно(ДеревоПапок, СоздаваемыеНаСервереПапки);
	Если СоздаваемыеНаСервереПапки.Количество()>0 Тогда
		Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись, Истина);
		
		Протокол = ПротоколИнтернетПочты.IMAP;
		
		Почта = Новый ИнтернетПочта;
		Попытка
			Почта.Подключиться(Профиль, Протокол);
		Исключение
			
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Во время подключения к учетной записи %1 произошла ошибка"
"%2'"),
			УчетнаяЗапись,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);	
			
			Возврат;
			
		КонецПопытки;
		
		Для каждого СоздаваемаяПапка из СоздаваемыеНаСервереПапки Цикл
			Попытка
				Почта.СоздатьПочтовыйЯщик(СоздаваемаяПапка.Ключ);
				
				СтруктураИзменений = Новый Структура("CRM_ИмяНаСервере", СоздаваемаяПапка.Ключ);
				CRM_ОбщегоНазначенияСервер.ИзменитьРеквизитыОбъекта(СоздаваемаяПапка.Значение, СтруктураИзменений);
				
				НоваяЗапись = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
				НоваяЗапись.Объект = СоздаваемаяПапка.Значение;
				НоваяЗапись.Действие = Перечисления.CRM_ДействияПоIMAP.ПереместитьВсеПисьмаВПапку;
				НоваяЗапись.УчетнаяЗапись = УчетнаяЗапись;
				НоваяЗапись.Записать();
			Исключение
				СтрокаДерева = ДеревоПапок.Строки.Найти(СоздаваемаяПапка.Ключ, "ИмяНаСервере");
				Если СтрокаДерева<>Неопределено Тогда
					СтрокаДерева.Подписаться = Ложь;
					СтрокаДерева.ИмяНаСервере = "";
				КонецЕсли;
				Описание = ОписаниеОшибки();
				ЕстьОшибки = Истина;
				Если СтрНайти(Описание, "Folder name is reserved") Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось создать на сервере папку %1, имя зарезервировано на сервере!'"), СоздаваемаяПапка.Ключ));
				ИначеЕсли СтрНайти(Описание, "Mailbox already exists") Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось создать на сервере папку %1, папка уже существует!'"), СоздаваемаяПапка.Ключ));
				ИначеЕсли СтрНайти(Описание, "Invalid mailbox name") Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось создать на сервере папку %1, недопустимое имя папки!'"), СоздаваемаяПапка.Ключ));
				Иначе
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'При создании на сервере папки %1 произошла ошибка"), СоздаваемаяПапка.Ключ)+ ": " + Описание);
				КонецЕсли;
			КонецПопытки;
		КонецЦикла;
	
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоПапок, "ПапкиУчетнойЗаписи");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПапкиРекурсивно(Дерево, СоздаваемыеНаСервереПапки)
	
	Для каждого Папка из Дерево.Строки Цикл
		Если ЗначениеЗаполнено(Папка.Ссылка) Тогда
			СтруктураИзменений = Новый Структура;
			Если ЗначениеЗаполнено(Папка.ИмяНаСервере) И НЕ ЗначениеЗаполнено(Папка.Ссылка.CRM_ИмяНаСервере) Тогда
				СтруктураИзменений.Вставить("CRM_ИмяНаСервере", Папка.ИмяНаСервере);
			КонецЕсли;
			Если Папка.Подписаться<>Папка.Ссылка.CRM_Подписаться Тогда
				СтруктураИзменений.Вставить("CRM_Подписаться", Папка.Подписаться);
			КонецЕсли;
			Если СтруктураИзменений.Количество()>0 Тогда
				CRM_ОбщегоНазначенияСервер.ИзменитьРеквизитыОбъекта(Папка.Ссылка, СтруктураИзменений);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Папка.ИмяНаСервере) И Папка.Подписаться Тогда
				Если ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") Тогда
					Папка.ИмяНаСервере = Дерево.ИмяНаСервере+Разделитель+Папка.Имя;
				Иначе
					Папка.ИмяНаСервере = Папка.Имя;
				КонецЕсли;
				СоздаваемыеНаСервереПапки.Вставить(Папка.ИмяНаСервере, Папка.Ссылка);
			КонецЕсли;
		ИначеЕсли Папка.Подписаться ИЛИ Папка.Строки.НайтиСтроки(Новый Структура("Подписаться", Истина), Истина).Количество()>0 Тогда
			ПапкаОбъект = Справочники.ПапкиЭлектронныхПисем.СоздатьЭлемент();
			Если ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") Тогда
				ПапкаОбъект.Родитель = Дерево.Ссылка;
			КонецЕсли;
			ПапкаОбъект.Наименование = Папка.Имя;
			ПапкаОбъект.CRM_ИмяНаСервере = Папка.ИмяНаСервере;
			ПапкаОбъект.CRM_Подписаться = Папка.Подписаться;
			ПапкаОбъект.Владелец = УчетнаяЗапись;
			ПапкаОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСIMAPСервера", Истина);
			ПапкаОбъект.Записать();
			Папка.Ссылка = ПапкаОбъект.Ссылка;
		КонецЕсли;
		ОбработатьПапкиРекурсивно(Папка, СоздаваемыеНаСервереПапки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ЕстьОшибки = Ложь;
	Если Модифицированность Тогда
		ПрименитьНаСервере(ЕстьОшибки);
		Оповестить("ИзмененыНастройкиСинхронизацииПапок", УчетнаяЗапись);
		Модифицированность = Ложь;
	КонецЕсли;
	Если НЕ ЕстьОшибки Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	УстановитьПодпискуВДереве(ПапкиУчетнойЗаписи, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтписатьВсе(Команда)
	УстановитьПодпискуВДереве(ПапкиУчетнойЗаписи, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПапкиУчетнойЗаписиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПапкиУчетнойЗаписиПодписатьПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти
